Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.IsTextTypeIdValid(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Document)
Verify if text type id is valid.
textTypeId:
Text type id to be validated.
doc:
Document for which %textTypeId% is validated.
Returns:
True if text type id is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.SetDeformedShapeSettings(Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings)
Set deformed shape settings object for the style.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Deformed shape settings were not created with the object.
Since:
2013

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.GetDeformedShapeSettings
Get deformed shape settings object from the style.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
deformed shape settings were not created with the object.
Since:
2013

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.HasDeformedShapeSettings
If true style has deformed shape settings.
Since:
2013

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.SetVectorSettings(Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings)
Set vector settings object for the style.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Vector settings were not created with the object.
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.GetVectorSettings
Get vector settings object from the style.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
vector settings were not created with the object.
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.HasVectorSettings
If true style has vector settings.
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.SetDiagramSettings(Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings)
Set diagram settings object for the style.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
diagram settings were not created with the object.
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.GetDiagramSettings
Get diagram settings object from the style.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
diagram settings were not created with the object.
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.HasDiagramSettings
If true style has diagram settings.
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.SetMarkersAndTextSettings(Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings)
Set markers and text settings object for the style.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
markers and text settings were not created with the object.
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.GetMarkersAndTextSettings
Get markers and text settings object from the style.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
markers and text settings were not created with the object.
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.HasMarkersAndTextSettings
If true style has markers and text settings.
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.SetColoredSurfaceSettings(Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings)
Set colored surface settings object for the style.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
colored surface settings were not created with the object.
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.GetColoredSurfaceSettings
Get colored surface settings object from the style.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
colored surface settings were not created with the object.
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.HasColoredSurfaceSettings
If true style has colored surface settings.
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.SetLegendSettings(Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings)
Set legend settings object for the style.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.GetLegendSettings
Get legend settings object from the style.
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.SetColorSettings(Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings)
Set color settings object for the style.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
for Diagram display style, colorSettings must have type SolidColorRanges and exactly one intermediate entry with zero value
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.GetColorSettings
Get color settings object from the style.
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.IsNameUnique(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle)
Verify the uniqueness of the name among all analysis display style elements of the document.
document:
Document in which name uniqueness is verified.
name:
Name to verify uniqueness of.
excludedElement:
Element to be excluded from uniqueness verification (for renaming of an existing element).
Returns:
True if name is unique, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.SetName(System.String)
Set name of analysis display style element.
name:
Analysis display style element name to be set.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is not unique in document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.FindByName(Autodesk.Revit.DB.Document,System.String)
Finds analysis display style by name.
document:
Document in which to look for analysis display style element.
name:
Name of analysis display style to look for.
Returns:
Element id of the found analysis display style, invalidElementId if not found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.GetElements(Autodesk.Revit.DB.Document)
Returns set of all analysis display styles elements in the given document.
document:
Document from which analysis display style elements are retrieved.
Returns:
All analysis display style elements existing in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.CreateAnalysisDisplayStyle(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings,Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings,Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings)
Factory method - creates analysis display style object of type Deformed Shape for the given document.
document:
Document for which analysis display style object is created.
name:
Name of the analysis display style within the %document%.
deformedShapeSettings:
Deformed Shape settings for the style.
colorSettings:
Color settings for the style.
legendSettings:
Legend settings for the style.
Returns:
New analysis display style object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
document is a family.
-or-
name is not unique in document.
Since:
2013

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.CreateAnalysisDisplayStyle(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings,Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings,Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings)
Factory method - creates analysis display style object of type Vectors for the given document.
document:
Document for which analysis display style object is created.
name:
Name of the analysis display style within the %document%.
vectorSettings:
Vector settings for the style.
colorSettings:
Color settings for the style.
legendSettings:
Legend settings for the style.
Returns:
New analysis display style object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
document is a family.
-or-
name is not unique in document.
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.CreateAnalysisDisplayStyle(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings,Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings,Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings)
Factory method - creates analysis display style object of type Diagram for the given document.
document:
Document for which analysis display style object is created.
name:
Name of the analysis display style within the %document%.
diagramSettings:
Diagram settings for the style.
colorSettings:
Color settings for the style.
legendSettings:
Legend settings for the style.
Returns:
New analysis display style object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
document is a family.
-or-
name is not unique in document.
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.CreateAnalysisDisplayStyle(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings,Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings,Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings)
Factory method - creates analysis display style object of type Markers and Text for the given document.
document:
Document for which analysis display style object is created.
name:
Name of the analysis display style within the %document%.
markersAndTextSettings:
Markers and text settings for the style.
colorSettings:
Color settings for the style.
legendSettings:
Legend settings for the style.
Returns:
New analysis display style object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
document is a family.
-or-
name is not unique in document.
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.CreateAnalysisDisplayStyle(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings,Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings,Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings)
Factory method - creates analysis display style object of type Colored Surface for the given document.
document:
Document for which analysis display style object is created.
name:
Name of the analysis display style within the %document%.
coloredSurfaceSettings:
Colored surface settings for the style.
colorSettings:
Color settings for the style.
legendSettings:
Legend settings for the style.
Returns:
New analysis display style object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
document is a family.
-or-
name is not unique in document.
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle
Exposes API for manipulation of analysis display style.
Since:
2011